Repository: JulNadeauCA/CADTools
Catalog: po/*.po
Languages: fr

source: Geometric model
fr: Modèle géométrique

source: Detaching %s...
fr: Détachement de %s...

source: %s: Threads are not responding!
fr: %s: Les threads ne répondent pas!

source: done
fr: terminé

source: Machine is online
fr: Machine disponible

source: Machine is busy or offline
fr: Machine occupée ou hors-ligne

source: Cannot find Camera: %s
fr: Impossible de trouver la Caméra: %s

source: Camera settings (%s)
fr: Paramètres de caméra (%s)

source: Cannot find Light: %s
fr: Impossible de trouver la Lumière: %s

source: Light settings
fr: Paramètres de lumière

source: Hostname/port not specified
fr: Nom d'hôte ou port non spécifié

source: Username/password not specified
fr: Code d'utilisateur ou mot de passe non spécifié

source: Machine enabled
fr: Machine active

source: Status
fr: État

source: Controller
fr: Controlleur

source: Hostname:
fr: Nom d'hôte:

source: Username:
fr: Code d'utilisateur:

source: Password:
fr: Mot de passe:

source: Enable machine
fr: Activer machine

source: Program Queue
fr: File d'attente programmes

source: Upload queue:
fr: File d'attente chargement:

source: Program
fr: Programme

source: Remote queue:
fr: File d'attente distante:

source: Owner
fr: Maître

source: 3D model
fr: Modèle 3D

source: Server refused data: %s
fr: Le serveur à refusé les données: %s

source: EOF from server
fr: Reçu EOF du serveur

source: Write error
fr: Erreur d'écriture

source: Upload incomplete
fr: Téléchargement incomplet

source: Commit failed: %s
fr: L'opération à échouée: %s

source: Program %s successfully uploaded to %s. Size: %lu bytes Response: %s
fr: Programme « %s » envoyé vers %s avec succès. Taille: %lu octets Réponse: %s

source: Not implemented yet
fr: Fonction non implémentée

source: Native cadtools part
fr: Pièce cadtools native

source: Stanford PLY
fr: PLY (Stanford)

source: Comment:
fr: Commentaire:

source: Save vertex normals
fr: Sauver les normals des sommets

source: Save vertex colors
fr: Sauver les couleurs des sommets

source: Save texture coords
fr: Sauver les coordonées de textures

source: Wavefront OBJ
fr: OBJ (Wavefront)

source: Scaling factor
fr: Facteur de taille

source: Load vertex normals
fr: Charger vecteurs normaux

source: Load vertex colors
fr: Charger les couleurs des sommets

source: Load texture coords
fr: Charger les coordonées de textures

source: Detect duplicate vertices
fr: Détecter les sommets en double

source: View
fr: Vue

source: Default
fr: Défaut

source: Front view
fr: Vue de face

source: Top view
fr: Vue de haut

source: Left view
fr: Vue de gauche

source: Camera settings...
fr: Paramètres de caméra...

source: Light0 settings...
fr: Paramètres de Lumière0...

source: Light1 settings...
fr: Paramètres de Lumière1...

source: Features
fr: Fonctions

source: Program: %s
fr: Programme: %s

source: Save changes to %s?
fr: Sauvegarder les changements effectuées à %s?

source: Save
fr: Sauvegarder

source: Discard
fr: Perdre les changements

source: Cancel
fr: Annuler

source: Open...
fr: Ouvrir...

source: cadtools sketch
fr: Esquisse cadtools

source: Save %s as...
fr: Sauvegarder %s sous...

source: AutoCAD DXF
fr: DXF (AutoCAD)

source: Binary format
fr: Format binaire

source: Error saving object: %s
fr: Erreur lors de la sauvegarde de l'objet: %s

source: Saved object %s successfully
fr: Sauvegarde de l'objet %s effectuée avec succès

source: Exit application?
fr: Quitter l'application?

source: There is at least one object with unsaved changes. Exit application?
fr: Au moins un objet à été modifié sans avoir été sauvegardé. Quitter l'application?

source: Discard changes
fr: Perdre les changements

source: New sketch...
fr: Nouvelle esquisse...

source: New part...
fr: Nouvelle pièce...

source: New program...
fr: Nouveau programme...

source: Save as...
fr: Sauvegarder sous...

source: New lathe...
fr: Nouveau tour...

source: New mill...
fr: Nouvelle fraiseuse...

source: Quit
fr: Quitter

source: Undo
fr: Défaire

source: Redo
fr: Refaire

source: Extruded boss/base
fr: Extrusion d'esquisse

source: Editor VFS
fr: Éditeur VFS

source: File
fr: Fichier

source: Edit
fr: Édition

source: Debug
fr: Déboguage

source: Dummy: %s
fr: Exemple: %s

source: Spindle on/off control
fr: Contrôle de la broche (on/off)

source: Spindle speed control
fr: Contrôle de la broche (vitesse)

source: Spindle tachometer readout
fr: Lecture de vitesse de la broche

source: Sync program with tachometer
fr: Synchroniser programme sur tachymètre

source: Specs
fr: Spéc.

source: Cross-slide travel:
fr: Course de la glissière transversale:

source: Carriage travel:
fr: Course du chariot transversal:

source: Compound travel:
fr: Course de la glissière supérieure:

source: Distance between centers:
fr: Distance entre les pointes:

source: Tailstock travel:
fr: Course de la contre-pointe:

source: Spindle
fr: Broche

source: Spindle bore diameter:
fr: Alésage:

source: Minimum RPM:
fr: RPM minimal:

source: Maximum RPM:
fr: RPM maximal:

source: Spindle power:
fr: Moteur:

source: Mist coolant control
fr: Contrôle refroidissant brumisateur

source: Flood coolant control
fr: Contrôle refroidissant inondant

source: Vortex tube control
fr: Contrôle tube de Ranque-Hilsch

source: X limit switches
fr: Interrupteurs de position X

source: Y limit switches
fr: Interrupteurs de position Y

source: Z limit switches
fr: Interrupteurs de position Z

source: Table length:
fr: Longueur de table:

source: Table width:
fr: Largeur de table:

source: X travel:
fr: Course X:

source: Y travel:
fr: Course Y:

source: Z travel:
fr: Course Z:
